src/InformationRegisters/Цены/Цены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Цены</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ДлительностьЦенаУслуги/Module.bsl
Функция ПолучитьИнформациюОбУслуги(Услуга, Дата) Экспорт
	
	Результат = Новый Структура("Длительность , Цена",  0, 0);

Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) КАК Цена,
	|	Услуги.Длительность
	|ИЗ
	|	Справочник.Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(&Дата, Услуга = &Услуга) КАК ЦеныСрезПоследних
	|		ПО Услуги.Ссылка = ЦеныСрезПоследних.Услуга
	|ГДЕ
	|	Услуги.Ссылка = &Услуга";
Запрос.УстановитьПараметр("Услуга", Услуга);
Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	Возврат Результат;	

КонецФункции
